In [41]:
import sqlalchemy as db
from getpass import getpass
import pymysql

In [42]:
password = getpass("Mysql Password: ")

Mysql Password: ········

In [43]:
dbName = "Publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [44]:
engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [45]:
import pandas as pd

In [85]:
df = pd.read_sql_query('''
SELECT 
	a.au_id 'AUTHOR ID', 
	au_lname 'LAST NAME', 
	au_fname 'FIRST NAME', 
	t.title TITLE, 
	pub_name PUBLISHER
		FROM Publications.authors a  
		INNER JOIN titleauthor ta ON a.au_id = ta.au_id
		LEFT JOIN titles t ON ta.title_id = t.title_id
		LEFT JOIN publishers p ON p.pub_id = t.pub_id''', engine)

In [87]:
df.head()

,AUTHOR ID,LAST NAME,FIRST NAME,TITLE,PUBLISHER
0,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books

In [91]:
df = pd.read_sql_query("""
SELECT 
	a.au_id 'AUTHOR ID', 
	au_lname 'LAST NAME', 
	au_fname 'FIRST NAME', 
	p.pub_name PUBLISHER,
    count(t.title) 'TITLE COUNT'
		FROM Publications.authors a  
		INNER JOIN titleauthor ta ON a.au_id = ta.au_id
		LEFT JOIN titles t ON ta.title_id = t.title_id
        LEFT JOIN publishers p ON t.pub_id = p.pub_id 
        GROUP BY a.au_id, p.pub_name
        ORDER BY a.au_id DESC;
    """ , engine) #funciona en MYSQL aqui me sale este error y no consiguo solucionarlo
df.head()

     AUTHOR ID LAST NAME FIRST NAME             PUBLISHER  TITLE COUNT
0  998-72-3567    Ringer     Albert        New Moon Books            2
1  899-46-2035    Ringer       Anne      Binnet & Hardley            1
2  899-46-2035    Ringer       Anne        New Moon Books            1
3  846-92-7186    Hunter     Sheryl  Algodata Infosystems            1
4  807-91-6654  Panteley     Sylvia      Binnet & Hardley            1

In [94]:
df = pd.read_sql_query("""
SELECT 
	a.au_id 'AUTHOR ID', 
	au_lname 'LAST NAME', 
	au_fname 'FIRST NAME',
    sum(t.ytd_sales) 'TOTAL'
		FROM authors a  
		INNER JOIN titleauthor ta ON a.au_id = ta.au_id
		LEFT JOIN titles t ON ta.title_id = t.title_id
        LEFT JOIN publishers p ON t.pub_id = p.pub_id 
        GROUP BY a.au_id
        ORDER BY TOTAL DESC;
    """ , engine)
df.head(3)

     AUTHOR ID LAST NAME FIRST NAME    TOTAL
0  899-46-2035    Ringer       Anne  24291.0
1  213-46-8915     Green   Marjorie  22817.0
2  722-51-5454  DeFrance     Michel  22246.0

In [95]:
#CHALLENGE 4 no acabado
df = pd.read_sql_query("""
SELECT 
	a.au_id 'AUTHOR ID', 
	au_lname 'LAST NAME', 
	au_fname 'FIRST NAME',
    sum(t.ytd_sales) 'TOTAL'
		FROM authors a  
		INNER JOIN titleauthor ta ON a.au_id = ta.au_id
		LEFT JOIN titles t ON ta.title_id = t.title_id
        INNER JOIN publishers p ON t.pub_id = p.pub_id 
        GROUP BY a.au_id
        ORDER BY 'TOTAL' DESC
    """ , engine)
df.head(3)

     AUTHOR ID LAST NAME FIRST NAME    TOTAL
0  213-46-8915     Green   Marjorie  22817.0
1  409-56-7008    Bennet    Abraham   4095.0
2  267-41-2394   O'Leary    Michael   7971.0